{"content":"<p><a href=\"https://www.drivecms.xyz/\">www.drivecms.xyz</a></p>\n<h2 id=\"introduction\">Introduction</h2>\n<p>The Google Drive CMS uses a combination of Google Sheets and Google Docs to maintain content on a website. These documents are sent to a site or a supporting service (e.g. <a href=\"https://words.mxbry.com/how-i-used-google-drive-and-firebase-to-give-my-static-site-a-cms-7226e01a51b5#.umrt2gwpz\">a Firebase database</a>) via a POST request to an API the admin specifies.</p>\n<p>The only <strong>requirements</strong> to run the Google Drive CMS are:</p>\n<ul>\n<li>A duplicate copy of the Google Drive CMS template</li>\n<li>An API endpoint to handle the data sent from the spreadsheet</li>\n</ul>\n<p>It is possible to run the CMS without writing server side code at the chosen API endpoint. The CMS&#39; content can be exported as a JSON file, or it can be added directly to any PAAS databases that expose an API. An example of using <a href=\"https://www.firebase.com/\">Firebase</a> to create the latter of these flows can be found on our <a href=\"/examples.html\">examples page</a>.</p>\n<h3 id=\"practical-examples\">Practical examples</h3>\n<p>The following scenarios are good use cases for the Google Drive CMS:</p>\n<ul>\n<li>A spreadsheet of names and addresses that are sent to an event website&#39;s REST API</li>\n<li>A news blog posting rich text content pulled from a Firebase database</li>\n<li>For exporting JSON to consume as part of the generation of a static site through Jekyll</li>\n<li>Triggering and writing email MailChimp campaigns through a Zapier backed service</li>\n</ul>\n<hr>\n<h2 id=\"installation\">Installation</h2>\n<p>To begin using the Google Drive CMS you need a copy of the core template. This core template contains the default configuration settings and the <a href=\"https://developers.google.com/apps-script/\">Google Apps Scripts</a> that live under the hood of the Google Drive CMS.</p>\n<p>To get a copy of the core template there are 3 options:</p>\n<ol>\n<li>Add it to you Google Drive direct from <a href=\"https://drivecms.xyz\">drivecms.xyz</a></li>\n<li>Make a copy of the core template yourself <a href=\"https://docs.google.com/spreadsheets/d/15ifxjEo9nVXTbeX7mwLnW-F5yu96u9IF1RL3wHoYLbs/edit?usp=sharing\">using this link</a></li>\n<li>Copy an existing Google Drive CMS template in your Google Drive</li>\n</ol>\n<p>After creating a copy of the core template, change the endpoint value within the <em>SETTINGS</em> sheet. For more information on configuring your Google Drive CMS template, see the <a href=\"#settings\">settings</a> section of this documentation.</p>\n<h3 id=\"publishing-content\">Publishing content</h3>\n<p>The Google Drive CMS will add a custom menu option to the top of the Google Sheets interface. The Google Drive CMS menu item contains two actions.</p>\n<p><strong>Publish</strong> publishes the CMS&#39; content to the designated endpoint</p>\n<p><strong>Export content</strong> exports the contents of the CMS as a JSON file to a directory called <code>_exports</code> inside of the same Google Drive folder that contains the base template itself</p>\n<hr>\n<h2 id=\"understanding-the-spreadsheet\">Understanding the spreadsheet</h2>\n<p>The core template has four tabs. Each tab can be accessed from Google Drive&#39;s tab navigation toolbar at the bottom of the page.</p>\n<h3 id=\"cms\">CMS</h3>\n<p>The main tab where an admin inputs their data.</p>\n<h4 id=\"headers\">Headers</h4>\n<p>The top row of the <em>CMS</em> tab represents the content&#39;s headers. These are used as the keys to map the content&#39;s data against in the JSON object sent to your endpoint. Headers behave similar to column names in a standard database.</p>\n<p><img src=\"http://drivecms.xyz/img/documentation/headers.png\" alt=\"Example of headers for a blog&#39;s CMS\" title=\"Example of headers for a blog&#39;s CMS\"></p>\n<h4 id=\"field-types\">Field types</h4>\n<p>Field types let admins add special functionality to a column. There are three field types, currently:</p>\n<ul>\n<li><strong>Simple</strong> (default): TRUE FALSE values are encoded to JSON as booleans, dates as date objects, numbers as integers and all other values as strings.</li>\n<li><strong>Eval</strong>: The contents of the cell is run against an <code>eval</code> function and stored as-is within the JSON object. Useful for complex data structures or nested objects</li>\n<li><strong>List</strong>: Provide a comma separated list of items within a cell and have them transformed in to a JavaScript array. For example, a cell containing <code>red, blue, green</code> will be transformed to the array <code>[&quot;red&quot;, &quot;blue&quot;, &quot;green&quot;]</code></li>\n<li><strong>Google Sheet</strong>: Point at another Google Sheet to create nested objects. See <a href=\"#nested-data\">Nested data</a> for more information</li>\n</ul>\n<p>n.b. A blank field type will behave like a simple field.</p>\n<p>We are looking to add more in the future, including foreign key relationships between multiple sheets. Eval is a good stopgap for more complex data, as it can accept raw JavaScript arrays or objects. <em>Update</em> Google Drive CMS now supports pointing at <a href=\"#nested-data\">other Google Sheets</a> to create neater nested objects.</p>\n<h4 id=\"content-rows\">Content rows</h4>\n<p>Each row beneath the field types will become an object within the JSON array sent to the designated API endpoint. These are the equivalent of a record within a traditional database.</p>\n<p>For example, an individual blog post is a content row, and it might have headers like &quot;title&quot; or &quot;publication date&quot;.</p>\n<h3 id=\"settings\">Settings</h3>\n<p>The <em>SETTINGS</em> tab within the Google Drive CMS template allows customization the CMS&#39; behavior.</p>\n<p>The following settings can be configured:</p>\n<ul>\n<li><code>endpoint</code> The endpoint the spreadsheet&#39;s data is sent to when published</li>\n<li><code>debug</code> Returns the JSON to the admin as an alert, as supposed to sending it to the designated endpoint. Useful for testing content rows before publishing on a live site</li>\n<li><code>saveFile</code> Whether the Google Drive CMS should save a copy of your exported data as a JSON file. This file is stored in a folder called <code>_export</code> found inside the same directory that holds the copy of the core template that requested the save</li>\n<li><code>headers</code> A JavaScript object structure containing HTTP headers to send with your request. Useful for passing any key additional information or context to your server. Alternatively use the <em>options</em> setting</li>\n<li><code>authorization</code> A configuration value specifically for the authorization header. Overwrites any <em>authorization</em> value found within your custom headers</li>\n<li><code>options</code> Additional keys to add to the JSON object sent to your server. If options are provided, then the content rows of the CMS will be stored behind a key called <code>data</code></li>\n<li><code>requestMethod</code> Send the CMS&#39; content with a custom request method, like PUT, GET or DELETE. By default the API will be contacted via via POST request</li>\n</ul>\n<h3 id=\"_internals\">_internals</h3>\n<p>It might be best to just leave this alone. Values in this tab power current and future functionality at a low level.</p>\n<hr>\n<h2 id=\"advanced-features\">Advanced features</h2>\n<h3 id=\"nested-data\">Nested data</h3>\n<p><em>NEW</em>\nUse a field type of <code>Google Sheet</code> to nest other Google Drive CMS sheets inside of your POST data.</p>\n<ol>\n<li><em>Create a secondary Google Drive CMS</em> The only sheet we really need is the default <code>CMS</code> sheet. You could alternatively create a blank Google Sheet with 2 rows (headers and field types), and your data underneath. The <code>SETTINGS</code>, <code>DOCUMENTATION</code> and <code>_internals</code> sheets on your secondary spreadsheet are not used.</li>\n<li>Copy and past the URL or spreadsheet ID in to your Drive CMS. Remember to set the field type to <code>Google Sheet</code>.</li>\n<li>Publish as normal</li>\n</ol>\n<p>Any data in the second spreadsheet will be added to your JSON payload as a nested array.</p>\n<h4 id=\"example\">Example</h4>\n<p><em>Google Sheet A (your Google Drive CMS instance)</em></p>\n<table>\n<thead>\n<tr>\n<th>title</th>\n<th>nested</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td><em>String</em></td>\n<td><em>Google Sheet</em></td>\n</tr>\n<tr>\n<td>A cool title</td>\n<td>&lt; URL of Google Sheet B &gt;</td>\n</tr>\n<tr>\n<td>Another cool title</td>\n</tr>\n</tbody>\n</table>\n<p><em>Google Sheet B (the data you want to nest)</em></p>\n<table>\n<thead>\n<tr>\n<th>FieldA</th>\n<th>FieldB</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td><em>String</em></td>\n<td><em>String</em></td>\n</tr>\n<tr>\n<td>Content that is nested</td>\n<td>Content that is also nested</td>\n</tr>\n<tr>\n<td>Second nested item</td>\n<td>Some information</td>\n</tr>\n</tbody>\n</table>\n<p><em>Result</em></p>\n<pre><code>[\n  {\n    &quot;title&quot;: &quot;A cool title&quot;,\n    &quot;nested&quot;: [\n      {\n        &quot;FieldA&quot;: &quot;Content that is nested&quot;,\n        &quot;FieldB&quot;: &quot;Content that is also nested&quot;\n      },\n      {\n        &quot;FieldA&quot;: &quot;Second nested item&quot;,\n        &quot;FieldB&quot;: &quot;Some information&quot;\n      }\n    ]\n  },\n  {\n    &quot;title&quot;: &quot;Another cool title&quot;,\n    &quot;nested&quot;: &quot;&quot;\n  }\n]\n</code></pre><p>You could probably nest sheets within sheets within sheets. That would probably work.\nDon&#39;t point spreadsheets at each other. That&#39;s going to end in a loop. That would probably be bad.</p>\n<h3 id=\"rich-text\">Rich text</h3>\n<p>It is possible to combine the Google Drive CMS core template with Google Docs to give an admin a rich text editor.</p>\n<p>Write a standard Google Doc using Google Doc&#39;s built in rich text capabilities (headings, links, inline imagery, etc.). Give that doc share settings that would allow the owner of the CMS core template at least view access. Add just the URL of that Google Doc to a cell within a content row of the CMS, and when published the Doc will be transformed in to raw HTML tags and added to the JSON payload.</p>\n<p>Google Docs are structured such that they can be exported straight to HTML. The CMS performs light sanitization of the converted HTML, but otherwise it is returned as a string within the JSON document upon publishing.</p>\n<h4 id=\"image-replacement\">Image replacement</h4>\n<p>Images inserted in to Google Docs are hosted on Google&#39;s CDN. When the rich text is extracted you&#39;ll have <code>img</code> tags with a <code>src=&quot;https://cdn.google.com/...&quot;</code>. That&#39;s okay-ish for small projects, or projects where images aren&#39;t vital. Google rate limit access to these URLs meaning every now and again your images will fail to load, as the Google CDN returns a 403.</p>\n<p>To get around this Google Drive CMS provides support for externally hosted images. In your rich text Google Doc that is being consumed by the drive CMS add the following inline:</p>\n<pre><code>This is the text content written in my Google Doc and here is my pretty image:\n\n[IMAGE:https://media.giphy.com/media/l46CqLVMWzaJUFPLW/giphy.gif]\n\nAnd then my text carries on like normal.\n</code></pre><p>When the rich text is extracted and posted to your JSON api your <code>img</code> tag will now have a source of <code>https://media.giphy.com/media/l46CqLVMWzaJUFPLW/giphy.gif</code> (<code>[IMAGE:]</code> is replaced). Using externally hosted images also allows you to use image formats that a Google Doc doesn&#39;t natively support (Gifs!).</p>\n<h3 id=\"slugify\">Slugify</h3>\n<p>A common CMS requirement is a slug field. A slug field can be used to build URLs on a site, and is often a concatenation of a title field with hyphens. For example, a news article called &quot;Big Announcement Coming&quot; would have a slug of &quot;big-announcement-coming&quot;.</p>\n<p>To expedite this process the Google Drive CMS has a shortcut function called SLUGIFY. Add the cell function <code>=SLUGIFY(:cell:)</code> to a cell in the CMS sheet, where :cell: is any string input (e.g. the corresponding cell in a <em>title</em> column).</p>\n<hr>\n<h2 id=\"best-practices\">Best practices</h2>\n<h3 id=\"securing-the-cms\">Securing the CMS</h3>\n<p>Consider access to the Google Drive CMS spreadsheet like the password and email logins for a traditional CMS. If you wouldn&#39;t want someone in your WordPress, don&#39;t share them access to your spreadsheet!</p>\n<p>To better understand the security and sharing potential of Google Drive, <a href=\"https://support.google.com/drive/answer/2494822?hl=en\">check out Google&#39;s documentation</a>.</p>\n<p>If sharing the CMS spreadsheet with other admins, consider locking down parts of the document using protected ranges. For example, protect the headers row of the spreadsheet to prevent another admin breaking a data structure the API endpoint requires.</p>\n<h3 id=\"revision-history\">Revision history</h3>\n<p>Admins can rollback to previous iterations using Google Drive&#39;s <a href=\"https://support.google.com/docs/answer/190843?hl=en\">built in revision history</a>. Restore a previous version of the sheet and then republish the document.</p>\n<h3 id=\"extending-the-cms\">Extending the CMS</h3>\n<p>All of the Apps Scripts that power the CMS are baked in to the sheet an admin edits. These scripts can be accessed via <code>Tools &gt; Script editor...</code> from the Google Sheets toolbar. We&#39;ve tried to comment the .gs files where possible, so hack and extend at will! Changes to these scripts will only effect the current instance of the CMS.</p>\n","headers":[{"id":"introduction","title":"Introduction"},{"id":"installation","title":"Installation"},{"id":"understanding-the-spreadsheet","title":"Understanding the spreadsheet"},{"id":"advanced-features","title":"Advanced features"},{"id":"best-practices","title":"Best practices"}]}