{"content":"<h2 id=\"introduction\">Introduction</h2>\n<p>The Google Drive CMS lets an admin to use a combination of Google Drive Spreadsheets and Docs to maintain content on a website. These documents are sent as JSON via a POST request to a URL endpoint the admin specifies.</p>\n<p>The only <strong>requirements</strong> to run the Google Drive CMS are:</p>\n<ul>\n<li>A duplicate copy of the Google Drive CMS template</li>\n<li>An endpoint to handle the data sent from the spreadsheet</li>\n</ul>\n<p>It is possible to run the CMS without fully fledged server side code at your chosen endpoint. Either an admin can export the CMS content as JSON, or you can use a PAAS database with an exposed API. An example of using <a href=\"https://www.firebase.com/\">Firebase</a> to create the latter of these flows can be found on our <a href=\"/examples\">examples page</a>.</p>\n<h3 id=\"practical-examples\">Practical examples</h3>\n<p>The following scenarios are good use cases for the Google Drive CMS:</p>\n<ul>\n<li>A spreadsheet of names and addresses that are sent to an event website&#39;s REST API</li>\n<li>A news blog posting rich text content pulled from a Firebase database</li>\n<li>For exporting JSON to consume as part of the generation of a static site through Jekyll</li>\n<li>Triggering and writing email MailChimp campaigns through a Zapier backed service</li>\n</ul>\n<hr>\n<h2 id=\"installation\">Installation</h2>\n<p>To begin using the Google Drive CMS you need a copy of the core template. This core template contains the default configuration settings and the <a href=\"https://developers.google.com/apps-script/\">Google Apps Scripts</a> that live under the hood of the Google Drive CMS.</p>\n<p>To get a copy of the core template there are 3 options:</p>\n<ol>\n<li>Add it to you Google Drive direct from <a href=\"https://drivecms.xyz\">drivecms.xyz</a></li>\n<li>Make a copy of the core template yourself <a href=\"\">using this link</a></li>\n<li>Copy an existing Google Drive CMS template in your Google Drive</li>\n</ol>\n<p>After creating a copy of the core template, change the <em>endpoint</em> value within the <em>SETTINGS</em> sheet. For more information on configuring you Google Drive CMS template, see the <a href=\"#settings\">settings</a> section of this documentation.</p>\n<h3 id=\"publishing-your-content\">Publishing your content</h3>\n<p>The Google Drive CMS will add a custom menu option to the top of your Google Sheets interface. The <em>Google Drive CMS</em> menu item contains two actions.</p>\n<p><strong>Publish</strong> publishes your content to the provided endpoint</p>\n<p><strong>Export content</strong> exports the contents of your CMS as a JSON to a directory called <code>_exports</code> inside of the same Google Drive folder that contains your copy of the base template   </p>\n<hr>\n<h2 id=\"understanding-the-spreadsheet\">Understanding the spreadsheet</h2>\n<p>The core template has four sheets. Each sheet can be accessed from Google Drive&#39;s sheet navigation toolbar at the bottom of the page.</p>\n<h3 id=\"cms\">CMS</h3>\n<p>The main sheet where an admin inputs their data.</p>\n<h4 id=\"headers\">Headers</h4>\n<p>The top row of the <em>CMS</em> sheet represents the CMS&#39; headers. These are used as the keys against which your data is mapped in the JSON object sent to your endpoint. Headers behave similar to column names in a standard database.</p>\n<p><img src=\"http://drivecms.xyz/img/documentation/headers.png\" alt=\"Example of headers for a blog&#39;s CMS\" title=\"Example of headers for a blog&#39;s CMS\"></p>\n<h4 id=\"field-types\">Field types</h4>\n<p>Field types let admins add special functionality to a column. There are three field types:</p>\n<ul>\n<li><strong>Simple</strong> (default): TRUE FALSE values are encoded to JSON as booleans, dates as date objects, numbers as integers and all other values as strings.</li>\n<li><strong>Eval</strong>: The contents of the cell is run against an <code>eval</code> function and stored as-is within the JSON object. Useful for complex data structures or nested objects</li>\n<li><strong>List</strong>: Provide a comma separated list of items within a cell and have them transformed in to a javascript array. For example, a cell containing <code>red, blue, green</code> will be transformed to the array <code>[&quot;red&quot;, &quot;blue&quot;, &quot;green&quot;]</code></li>\n</ul>\n<p>n.b. A blank field type will behave like a simple field.</p>\n<h4 id=\"content-rows\">Content Rows</h4>\n<p>Each row beneath the field types will become an object within the JSON array sent to your endpoint. These are the equivalent of a record within a traditional database. Each may represent, for example, a blog post on your site.</p>\n<h3 id=\"settings\">SETTINGS</h3>\n<p>Configure the CMS with many settings, including:</p>\n<ul>\n<li><code>endpoint</code> The endpoint the spreadsheet&#39;s data is sent to when published</li>\n<li><code>debug</code> Returns the JSON to the admin as an alert, as supposed to sending it to your endpoint. Useful for testing your rows before publishing live on your website</li>\n<li><code>saveFile</code> Whether the Google Drive CMS should save a copy of your exported data as a JSON file. This file is stored in a folder called <code>_export</code> found inside the same directory that holds your copy of the core template</li>\n<li><code>headers</code> A javascript object structure containing HTTP headers to send with your request. Useful for passing any key additional information or context to your server. Alternatively use the <em>options</em> setting</li>\n<li><code>authorization</code> A configuration value specifically for the authorization header. Overwrites any <em>authorization</em> value found within your custom headers</li>\n<li><code>options</code> Additional keys to add to the JSON object sent to your server. If  options are provided, the the array of your CMS&#39; rows will be stored behind a key called <code>data</code></li>\n<li><code>requestMethod</code> Send your CMS records with a PUT, GET or DELETE request method. By default they will be sent via POST</li>\n</ul>\n<h3 id=\"_internals\">_internals</h3>\n<p>It might be best to just leave this alone. Values in this sheet power current and future functionality at a low level. </p>\n<hr>\n<h2 id=\"special-field-types\">Special field types</h2>\n<h3 id=\"rich-text\">Rich text</h3>\n<p>It is possible to combine the Google Drive CMS core template with Google Docs to give your admin a rich text editor. Have the admin write their rich text in to a standard Google Doc, and then give that doc share settings that allow the CMS admin at least view access. Add just the URL of the Google Doc to a cell within your CMS, and when published the Doc will be transformed in to raw HTML tags and added to the JSON payload.</p>\n<h3 id=\"slugify\">Slugify</h3>\n<p>A common CMS requirement is a slug field. A slug field can be used to build URLs on a site, and is often a concatenation of a title field with hyphens. For example, a news article called &quot;Big Announcement Coming&quot; would have a slug of &quot;big-announcement-coming&quot;.</p>\n<p>To expedite this process the Google Drive CMS has a shortcut function called SLUGIFY. Add the cell function <code>=SLUGIFY(:cell:)</code> to a cell in your CMS sheet, where :cell: is any string input (e.g. the corresponding cell in a <em>title</em> column).</p>\n<hr>\n<h2 id=\"best-practices\">Best practices</h2>\n<h3 id=\"securing-your-cms\">Securing your CMS</h3>\n<p>Consider access to your Google Drive CMS spreadsheet like you would the password and email logins for a traditional CMS. If you wouldn&#39;t want someone in your WordPress, don&#39;t share them access to your spreadsheet!</p>\n<p>To better understand the security and sharing potential of Google Drive, <a href=\"https://support.google.com/drive/answer/2494822?hl=en\">check out Google&#39;s documentation</a>.</p>\n<p>If you are sharing the CMS spreadsheet with other admins, consider locking down parts of the document using protected ranges. For example, protect the headers row of your spreadsheet to prevent another admin breaking a part of your site.</p>\n<h3 id=\"revision-history\">Revision history</h3>\n<p>Admins can rollback to previous iterations using Google Drive&#39;s <a href=\"https://support.google.com/docs/answer/190843?hl=en\">built in revision history</a>. Restore a previous version of the sheet and then republish the document.</p>\n<h3 id=\"extending-the-cms\">Extending the CMS</h3>\n<p>All of the Apps Scripts that power the CMS are baked in to the sheet your admin edits. These scripts can be accessed via <code>Tools &gt; Script editor...</code> from the Google Sheets toolbar. We&#39;ve tried to comment the .gs files where possible, so hack and extend at will! Changes to these scripts will only effect the current instance of the CMS. </p>\n","headers":[{"id":"introduction","title":"Introduction"},{"id":"installation","title":"Installation"},{"id":"understanding-the-spreadsheet","title":"Understanding the spreadsheet"},{"id":"special-field-types","title":"Special field types"},{"id":"best-practices","title":"Best practices"}]}